people_dict = {
    'студенты': {
        'Сергей': {
            'Возраст': 19,
            "Пол": "М",
            "Курс": 3
        },
        'Алексей': {
            'Возраст': 21,
            "Пол": "М",
            "Курс": 3
        },
        'Марина': {
            'Возраст': 18,
            "Пол": "Ж",
            "Курс": 2
        },
    },
    'работники': {
        'Илья': {
            'Возраст': 25,
            "Пол": "М",
            "Должность": "Инженер"
        },
        'Алексей': {
            'Возраст': 29,
            "Пол": "М",
            "Должность": "Инженер"
        },
        'Мария': {
            'Возраст': 24,
            "Пол": "Ж",
            "Должность": "Секретарь"
        },
    },
    'остальные': {
        "Александр": {
            'Возраст': 25,
            "Пол": "М",
            "Должность": "Инженер"
        },
        'Владимир': {
            'Возраст': 29,
            "Пол": "М",
            "Должность": "Инженер"
        },
        'Мария': {
            'Возраст': 24,
            "Пол": "Ж",
            "Должность": "Секретарь"
        },
    }
}

s = input('Введите категорию поиска: ')
if people_dict.get(s) is not None:
    s1 = input('Введите имя: ')
    print(people_dict[s][s1])
